class Regexp
  module Formats
    NAME = /^[a-zA-Z\s\-\'\á\à\ä\â\ã\ç\é\è\ë\ê\í\ì\ï\î\ñ\ó\ò\ö\ô\õ\ú\ù\ü\û\Á\À\Ä\Â\Ã\Ç\É\È\Ë\Ê\Í\Ì\Ï\Î\Ñ\Ó\Ò\Ö\Ô\Õ\Ú\Ù\Ü\Û]{1,255}$/
    ORGANIZATION = /^[a-zA-Z0-9 \.\,\-\'\á\à\ä\â\ã\ç\é\è\ë\ê\í\ì\ï\î\ñ\ó\ò\ö\ô\õ\ú\ù\ü\û\Á\À\Ä\Â\Ã\Ç\É\È\Ë\Ê\Í\Ì\Ï\Î\Ñ\Ó\Ò\Ö\Ô\Õ\Ú\Ù\Ü\Û]{1,255}$/
    LOCATION = /^[a-zA-Z\s\-\,\.\'\á\à\ä\â\ã\ç\é\è\ë\ê\í\ì\ï\î\ñ\ó\ò\ö\ô\õ\ú\ù\ü\û\Á\À\Ä\Â\Ã\Ç\É\È\Ë\Ê\Í\Ì\Ï\Î\Ñ\Ó\Ò\Ö\Ô\Õ\Ú\Ù\Ü\Û]{1,255}$/
    LOGIN = /^[a-zA-Z\d_]{2,40}$/
    EMAIL = %r{^((?:(?:(?:[a-zA-Z0-9][\'\.\-\+_!#%&\*|~=/^]?)*)[a-zA-Z0-9])+)\@((?:(?:(?:[a-zA-Z0-9][\.\-_]?){0,62})[a-zA-Z0-9])+)\.([a-zA-Z0-9]{2,6})$}
    DOMAIN = /^[a-z0-9]+([\-\.]{1}[a-z0-9]+)*\.[a-z]{2,5}$/ix
    URL = /^(http|https):\/\/(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}|[a-z0-9]+([\-\.]{1}[a-z0-9]+)*\.[a-z]{2,5})(([0-9]{1,5})?\/.*)?$/ix
    # This seems to be a better Regexp, but it's actually more permissive than Ruby URI allows causing an error
    # URL = Regexp.new('^(?#Protocol)(?:(?:ht|f)tp(?:s?)\:\/\/|~/|/)?(?#Username:Password)(?:\w+:\w+@)?(?#Subdomains)(?:(?:[-\w]+\.)+(?#TopLevel Domains)(?:com|org|net|gov|mil|biz|info|mobi|name|aero|jobs|museum|travel|[a-z]{2}))(?#Port)(?::[\d]{1,5})?(?#Directories)(?:(?:(?:/(?:[-\w~!$+|.,=]|%[a-f\d]{2})+)+|/)+|\?|#)?(?#Query)(?:(?:\?(?:[-\w~!$+|.,*:]|%[a-f\d{2}])+=(?:[-\w~!$+|.,*:=]|%[a-f\d]{2})*)(?:&(?:[-\w~!$+|.,*:]|%[a-f\d{2}])+=(?:[-\w~!$+|.,*:=]|%[a-f\d]{2})*)*)*(?#Anchor)(?:#(?:[-\w~!$+|.,*:=]|%[a-f\d]{2})*)?$')
    PATH = /^[\/\w\.]{1,255}$/
    CURRENCY = /(\d)(?=\d{3}+(\.\d{1,2})?$)/
    ADDRESS = /^[\w\d\s\-\.\#\,\&\'\/\\]+$/
    ZIPCODE = /^[0-9]{5}$/
    PERMALINK = /^[\w\d\._\-\%]+$/
    # Validates US Phone numbers
    PHONE = /^((\(\d{3}\)?)|(\d{3}))([\s\-\.]?)(\d{3})([\s\-\.]?)(\d{4})$/
  end
end
